Public Attributes | List of all members
API_Texture Struct Reference
ModelAccess API
Texture reference. More...
#include <APIdefs_Attributes.h>
 Public Attributes
short  | status
Texture status.
bool  | missingPict
Picture is missing (output only)
double  | xSize
X size of the picture in model space.
double  | ySize
Y size of the picture in model space.
double  | rotAng
Rotation angle in radians.
Int32  | irtxt
for internal use
GS::uchar_t  | texName [API_UniLongNameLen]
The name of the texture file as UTF-8 encoded C string.
IO::Location *  | fileLoc
Texture file location in the file system.
bool  | withoutExtension
[in] Indicates that the extension was not appended to the texture name.
Detailed Description
Texture reference.
Member Data Documentation
◆ fileLoc
 API_Texture::fileLoc
Texture file location in the file system.
◆ irtxt
 API_Texture::irtxt
for internal use
◆ missingPict
 API_Texture::missingPict
Picture is missing (output only)
◆ rotAng
 API_Texture::rotAng
Rotation angle in radians.
◆ status
 API_Texture::status
Texture status.
◆ texName
 API_Texture::texName
The name of the texture file as UTF-8 encoded C string.
◆ withoutExtension
 API_Texture::withoutExtension
[in] Indicates that the extension was not appended to the texture name.
◆ xSize
 API_Texture::xSize
X size of the picture in model space.
◆ ySize
 API_Texture::ySize
Y size of the picture in model space.